Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: You can check in the interface and the adaptor somewhere near `Concrete` (perhaps in a `contrib` sub-directory) and let many projects use it.
it_it: Si può archiviare l'interfaccia e l'adattatore [adaptor] da qualche parte vicino a `Concrete` (probabilmente in una sotto-directory `contrib`) e lasciare che molti progetti la utilizzino.

source: You can choose a particular style of death tests by setting the flag programmatically:
it_it: Si può scegliere un stile dei death test, impostando il flag a livello di codice:

source: You can combine this with the --gtest_filter flag to further select which disabled tests to run.
it_it: Lo si può combinare col flag --gtest_filter per selezionare ulteriormente quali test disabilitati eseguire.

source: You can combine this with the `--gtest_filter` flag to further select which disabled tests to run.
it_it: Lo si può combinare col flag `--gtest_filter` per selezionare ulteriormente quali test disabilitati eseguire.

source: You can control how much gMock tells you using the --gmock_verbose=LEVEL command-line flag, where LEVEL is a string with three possible values:
it_it: Si può controllare quanto gMock stampa utilizzando il flag della riga di comando --gmock_verbose=LEVEL, dove LEVEL è una stringa con tre possibili valori:

source: You can control how much gMock tells you using the `--gmock_verbose=LEVEL` command-line flag, where `LEVEL` is a string with three possible values:
it_it: Si può controllare quanto gMock stampa utilizzando il flag della riga di comando `--gmock_verbose=LEVEL`, dove `LEVEL` è una stringa con tre possibili valori:

source: You can control whether the turtle's movement will leave a trace using PenUp() and PenDown(), and control its movement using Forward(), Turn(), and GoTo().
it_it: Si può controllare se il movimento della tartaruga lascerà una traccia usando PenUp() e PenDown() e controllarne il movimento con Forward(), Turn() e GoTo().

source: You can control whether the turtle's movement will leave a trace using `PenUp()` and `PenDown()`, and control its movement using `Forward()`, `Turn()`, and `GoTo()`.
it_it: Si può controllare se il movimento della tartaruga lascerà una traccia usando `PenUp()` e `PenDown()` e controllarne il movimento con `Forward()`, `Turn()` e `GoTo()`.

source: You can create an AssertionResult using one of these factory functions:
it_it: Un AssertionResult si può creare utilizzando una di queste funzioni "factory":

source: You can create an `AssertionResult` using one of these factory functions:
it_it: Un `AssertionResult` si può creare utilizzando una di queste funzioni "factory":

source: You can do deallocation of resources in TearDown or the destructor routine.
it_it: Si possono effettuare la deallocazione delle risorse in TearDown o nella routine del distruttore.

source: You can do initialization or allocation of resources in either the constructor or the SetUp method.
it_it: È possibile eseguire l'inizializzazione o l'allocazione delle risorse nel costruttore o nel metodo SetUp.

source: You can do so by adding one line:
it_it: Lo si può fare aggiungendo una riga:

source: You can do this with Mock::VerifyAndClearExpectations(&mock_object):
it_it: Lo si può fare con Mock::VerifyAndClearExpectations(&mock_object):

source: You can do this in main() to set the style for all death tests in the binary, or in individual tests.
it_it: Lo si può fare nel main() per impostare lo stile per tutti i death test nel binario o nei singoli test.

source: You can do this in `main()` to set the style for all death tests in the binary, or in individual tests.
it_it: Lo si può fare nel `main()` per impostare lo stile per tutti i death test nel binario o nei singoli test.

source: You can do this in gMock using callbacks with pre-bound arguments.
it_it: In gMock lo si può fare utilizzando le callback con argomenti pre-associati [pre-bound].

source: You can do this using the ::testing::DefaultValue class template:
it_it: Lo si può fare utilizzando la classe template ::testing::DefaultValue:

source: You can do this using the `::testing::DefaultValue` class template:
it_it: Lo si può fare utilizzando la classe template `::testing::DefaultValue`:

source: You can do this with Field() and Property().
it_it: Lo si può fare con Field() e con Property().

source: You can do this with `Field()` and `Property()`.
it_it: Lo si può fare con `Field()` e con `Property()`.

source: You can do this with `Mock::VerifyAndClearExpectations(&mock_object)`:
it_it: Lo si può fare con `Mock::VerifyAndClearExpectations(&mock_object)`:

source: You can dump the output into XML format by passing --gtest_output="xml:report.xml" on the command line.
it_it: Si può eseguire il dump dell'output in formato XML passando --gtest_output="xml:report.xml" sulla riga di comando.

source: You can easily achieve the same effect without using gMock.
it_it: Si può facilmente ottenere lo stesso effetto senza utilizzare gMock.

source: You can even instantiate it more than once in the same program.
it_it: Si può anche crearne un'istanza più di una volta nello stesso programma.

source: You can find recipes for using gMock here.
it_it: Qui si trovano delle ricette per utilizzare gMock.

source: You can inject different functionality from the test and from the production code.
it_it: È possibile iniettare funzionalità diverse dal codice di test e quello di produzione.

source: You can instantiate a test pattern more than once, so to distinguish different instances of the pattern, the instantiation name is added as a prefix to the actual test suite name.
it_it: È possibile istanziare un pattern di test più di una volta, quindi per distinguere le diverse istanze del pattern, il nome di istanziazione viene aggiunto come prefisso a quello effettivo della test suite.

source: You can instantiate the same abstract test suite multiple times, possibly in different source files.
it_it: È possibile istanziare la stessa test suite astratta più volte, possibilmente in file sorgenti diversi.

source: You can instead save the arguments and test them individually:
it_it: Si possono invece salvare gli argomenti e testarli individualmente:

source: You can learn to ignore the errors, or you can rewrite your expectations to make your test more robust, for example, by adding something like:
it_it: Si può imparare a ignorare gli errori oppure si possono riscrivere le aspettative per rendere il test più robusto, ad esempio aggiungendo qualcosa come:

source: You can leave the argument list unspecified and use SaveArg actions to save the values for later verification.
it_it: Si può lasciare l'elenco degli argomenti non specificato e utilizzare le azioni SaveArg per salvare i valori per una successiva verifica.

source: You can leave the argument list unspecified and use SaveArg actions to [save the values for later verification](#SaveArgVerify).
it_it: Si può lasciare l'elenco degli argomenti non specificato e utilizzare le azioni SaveArg per [salvare i valori per una successiva verifica](#SaveArgVerify).

source: You can make a matcher from one or more other matchers:
it_it: Si possono creare un matcher da uno o più altri matcher:

source: You can mock class templates just like any class.
it_it: Si può avere la versione mock di classi template come con qualsiasi classe.

source: You can mock overloaded functions as usual.
it_it: Si possono avere funzioni overloaded mock-ate come al solito.

source: You can overload matchers with different numbers of parameters:
it_it: Si può avere l'overload dei matcher con diversi numeri di parametri:

source: You can repeat this as many times as you want:
it_it: Lo si può ripetere più volte:

source: You can repeat an argument in the argument list if necessary, e.g. WithArgs<2, 3, 3, 5>(...).
it_it: Se necessario è possibile ripetere un argomento nell'elenco, ad es. WithArgs<2, 3, 3, 5>(...).

source: You can repeat an argument in the argument list if necessary, e.g. `WithArgs<2, 3, 3, 5>(...)`.
it_it: Se necessario è possibile ripetere un argomento nell'elenco, ad es. `WithArgs<2, 3, 3, 5>(...)`.

source: You can repeat the same test a thousand times using the Google framework.
it_it: Si può ripetere lo stesso test mille volte utilizzando il framework di Google.

source: You can return a reference using ReturnRef(variable), or invoke a pre-defined function, among others.
it_it: Si può restituire un riferimento utilizzando ReturnRef(variable), o richiamare una funzione pre-definita, tra [others] (altre).

source: You can return a reference using `ReturnRef(`*`variable`*`)`, or invoke a pre-defined function, among [others](gmock_cook_book.md#using-actions).
it_it: Si può restituire un riferimento utilizzando `ReturnRef(`*`variable`*`)`, o richiamare una funzione pre-definita, tra [[others] (altre)](gmock_cook_book.md#using-actions).

source: You can see sample6_unittest.cc for a complete example.
it_it: Si può vedere sample6_unittest.cc per un esempio completo.

source: You can see sample7_unittest.cc and sample8_unittest.cc for more examples.
it_it: Esaminare sample7_unittest.cc e sample8_unittest.cc per altri esempi.

source: You can see [sample6_unittest.cc] for a complete example.
it_it: Si può vedere [sample6_unittest.cc] per un esempio completo.

source: You can see [sample7_unittest.cc] and [sample8_unittest.cc] for more examples.
it_it: Esaminare [sample7_unittest.cc] e [sample8_unittest.cc] per altri esempi.

source: You can set the GTEST_COLOR environment variable or the --gtest_color command line flag to yes, no, or auto (the default) to enable colors, disable colors, or let GoogleTest decide.
it_it: Si può impostare la variabile di ambiente GTEST_COLOR o il flag della riga di comando --gtest_color a yes, no o auto (il default) per abilitare i colori, disabilitarli o lasciare che sia GoogleTest a decidere.

source: You can set the `GTEST_COLOR` environment variable or the `--gtest_color` command line flag to `yes`, `no`, or `auto` (the default) to enable colors, disable colors, or let GoogleTest decide.
it_it: Si può impostare la variabile di ambiente `GTEST_COLOR` o il flag della riga di comando `--gtest_color` a `yes`, `no` o `auto` (il default) per abilitare i colori, disabilitarli o lasciare che sia GoogleTest a decidere.

source: You can simply use "".
it_it: Basta usare "".

source: You can simply use `""`.
it_it: Basta usare `""`.

source: You can specify exactly which arguments a mock method is expecting:
it_it: Si può specificare esattamente quali argomenti si aspetta un metodo mock:

source: You can specify the --gtest_shuffle flag (or set the GTEST_SHUFFLE environment variable to 1) to run the tests in a program in a random order.
it_it: Si può specificare il flag --gtest_shuffle (o impostare la variabile di ambiente GTEST_SHUFFLE a 1) per eseguire i test in un programma in ordine casuale .

source: You can specify the `--gtest_shuffle` flag (or set the `GTEST_SHUFFLE` environment variable to `1`) to run the tests in a program in a random order.
it_it: Si può specificare il flag `--gtest_shuffle` (o impostare la variabile di ambiente `GTEST_SHUFFLE` a `1`) per eseguire i test in un programma in ordine casuale.

source: You can start from this boilerplate:
it_it: Si può iniziare da questo prototipo:

source: You can then use the << operator to stream messages to the AssertionResult object.
it_it: È poi possibile utilizzare l'operatore << per lo streaming dei messaggi all'oggetto AssertionResult.

source: You can then use the `<<` operator to stream messages to the `AssertionResult` object.
it_it: È poi possibile utilizzare l'operatore `<<` per lo streaming dei messaggi all'oggetto `AssertionResult`.

source: You can think of them as running in a parallel universe, more or less.
it_it: Si possono pensare come se venissero eseguiti in un universo parallelo, più o meno.

source: You can unlock this power by running your test with the --gmock_verbose=info flag.
it_it: Si può sbloccare questo potere eseguendo il test con il flag --gmock_verbose=info.

source: You can unlock this power by running your test with the `--gmock_verbose=info` flag.
it_it: Si può sbloccare questo potere eseguendo il test con il flag `--gmock_verbose=info`.

source: You can use Args<k1, ..., kn>(m) to match the n selected arguments (as a tuple) against m.
it_it: Si può usare Args<k1, ..., kn>(m) per far corrispondere gli n argomenti selezionati (come una tupla) con m.

source: You can use DescribeMatcher<> to describe another matcher.
it_it: Si può usare DescribeMatcher<> per descrivere un altro matcher.

source: You can use ExplainMatchResult() in a custom matcher to wrap another matcher, for example:
it_it: Si può usare ExplainMatchResult() in un matcher personalizzato per racchiudere un altro matcher, ad esempio:

source: You can use FieldsAre() to match any type that supports structured bindings, such as std::tuple, std::pair, std::array, and aggregate types.
it_it: Si può usare FieldsAre() per trovare la corrispondenza con qualsiasi tipo che supporti associazioni strutturate, come std::tuple, std::pair, std::array e i tipi aggregati.

source: You can use PrintToString(x) to convert a value x of any type to a string.
it_it: Si può usare PrintToString(x) per convertire un valore x di qualsiasi tipo in una stringa.

source: You can use SCOPED_TRACE in an inner scope when there is one in the outer scope.
it_it: Si può utilizzare SCOPED_TRACE in uno scope interno (annidato) quando ce n'è uno nello scope esterno.

source: You can use Matches(m) alone as a unary functor.
it_it: Si può usare Matches(m) da solo come funtore unario.

source: You can use `Args<k1, ..., kn>(m)` to match the `n` selected arguments (as a tuple) against `m`.
it_it: Si può usare `Args<k1, ..., kn>(m)` per far corrispondere gli `n` argomenti selezionati (come una tupla) con `m`.

source: You can use `DescribeMatcher<>` to describe another matcher.
it_it: Si può usare `DescribeMatcher<>` per descrivere un altro matcher.

source: You can use `ExplainMatchResult()` in a custom matcher to wrap another matcher, for example:
it_it: Si può usare `ExplainMatchResult()` in un matcher personalizzato per racchiudere un altro matcher, ad esempio:

source: You can use `FieldsAre()` to match any type that supports structured bindings, such as `std::tuple`, `std::pair`, `std::array`, and aggregate types.
it_it: Si può usare `FieldsAre()` per trovare la corrispondenza con qualsiasi tipo che supporti associazioni strutturate, come `std::tuple`, `std::pair`, `std::array` e i tipi aggregati.

source: You can use `Matches(m)` alone as a unary functor.
it_it: Si può usare `Matches(m)` da solo come funtore unario.

source: You can use `PrintToString(x)` to convert a value `x` of any type to a string.
it_it: Si può usare `PrintToString(x)` per convertire un valore `x` di qualsiasi tipo in una stringa.

source: You can use `SCOPED_TRACE` in an inner scope when there is one in the outer scope.
it_it: Si può utilizzare `SCOPED_TRACE` in uno scope interno (annidato) quando ce n'è uno nello scope esterno.

source: You can use a matcher inside EXPECT_CALL() wherever a function argument is expected.
it_it: Si può utilizzare un matcher all'interno di EXPECT_CALL() ovunque sia previsto un argomento di funzione.

source: You can use a matcher inside `EXPECT_CALL()` wherever a function argument is expected.
it_it: Si può utilizzare un matcher all'interno di `EXPECT_CALL()` ovunque sia previsto un argomento di funzione.

source: You can use assertions in any C++ function.
it_it: Le asserzioni si possono usare in qualsiasi funzione C++.

source: You can use it inside ON_CALL() or EXPECT_CALL(), or use it to validate a value directly using two macros:
it_it: Lo si può usare in una ON_CALL() o in una EXPECT_CALL(), oppure usarlo per convalidare un valore direttamente utilizzando due macro:

source: You can use it inside `ON_CALL()` or `EXPECT_CALL()`, or use it to validate a value directly using two macros:
it_it: Lo si può usare in una `ON_CALL()` o in una `EXPECT_CALL()`, oppure usarlo per convalidare un valore direttamente utilizzando due macro:

source: You can use matchers like IsNull(), NotNull(), and other comparison matchers to match a pointer, but what if you want to make sure the value pointed to by the pointer, instead of the pointer itself, has a certain property?
it_it: Si possono usare matcher come IsNull(), NotNull() e altri per avere una corrispondenza con un puntatore, ma cosa succede se ci si vuol accertare che il valore puntato dal puntatore, anziché il puntatore stesso, ha una certa proprietà?

source: You can use matchers like `IsNull()`, `NotNull()`, and other comparison matchers to match a pointer, but what if you want to make sure the value *pointed to* by the pointer, instead of the pointer itself, has a certain property?
it_it: Si possono usare matcher come `IsNull()`, `NotNull()` e altri per avere una corrispondenza con un puntatore, ma cosa succede se ci si vuol accertare che il valore *puntato* dal puntatore, anziché il puntatore stesso, ha una certa proprietà?

source: You can use matchers to match arguments that have a certain property:
it_it: I matcher si possono usare per abbinare [match] argomenti che hanno una certa proprietà:

source: You can use nested ElementsAre*() to match nested (multi-dimensional) containers.
it_it: Si possono usare ElementsAre*() nidificati per [to match] container nidificati (multi-dimensionali).

source: You can use nested `ElementsAre*()` to match nested (multi-dimensional) containers.
it_it: Si possono usare `ElementsAre*()` nidificati per [to match] container nidificati (multi-dimensionali).

source: You can use the *delegating-to-real* technique to ensure that your mock has the same behavior as the real object while retaining the ability to validate calls.
it_it: Si può utilizzare la tecnica *delegating-to-real* per fare in modo che il mock abbia lo stesso comportamento dell'oggetto reale pur mantenendo la capacità di convalidare le chiamate.

source: You can use the ElementsAre() or UnorderedElementsAre() matcher in such cases:
it_it: In questi casi si può utilizzare il matcher ElementsAre() o UnorderedElementsAre():

source: You can use the delegating-to-real technique to ensure that your mock has the same behavior as the real object while retaining the ability to validate calls.
it_it: Si può utilizzare la tecnica delegating-to-real per fare in modo che il mock abbia lo stesso comportamento dell'oggetto reale pur mantenendo la capacità di convalidare le chiamate.

source: You can use the `ElementsAre()` or `UnorderedElementsAre()` matcher in such cases:
it_it: In questi casi si può utilizzare il matcher `ElementsAre()` o `UnorderedElementsAre()`:

source: You can use the following selectors to pick a subset of the arguments (or reorder them) to participate in the matching:
it_it: Si possono utilizzare i seguenti selettori per scegliere un sottoinsieme di argomenti (o riordinarli) per partecipare alla corrispondenza:

source: You can use the gMock string matchers with EXPECT_THAT to do more string comparison tricks (sub-string, prefix, suffix, regular expression, and etc).
it_it: Si possono usare i matcher di stringhe di gMock con EXPECT_THAT per fare altri tipi di confronti tra stringhe (sotto-stringa, prefisso, suffisso, espressione regolare, ecc.).

source: You can use the gMock [string matchers](reference/matchers.md#string-matchers) with [`EXPECT_THAT`](reference/assertions.md#EXPECT_THAT) to do more string comparison tricks (sub-string, prefix, suffix, regular expression, and etc).
it_it: Si possono usare i [matcher di stringhe](reference/matchers.md#string-matchers) di gMock con [`EXPECT_THAT`](reference/assertions.md#EXPECT_THAT) per fare altri tipi di confronti tra stringhe (sotto-stringa, prefisso, suffisso, espressione regolare, ecc.).

source: You can use these names in --gtest_filter.
it_it: Si possono usare questi nomi in --gtest_filter.

source: You can use these names in [`--gtest_filter`](#running-a-subset-of-the-tests).
it_it: Si possono usare questi nomi in [`--gtest_filter`](#running-a-subset-of-the-tests).

source: You can view ACTION as a degenerated parameterized action where the number of parameters is 0.
it_it: Si può vedere ACTION come un'azione parametrizzata degenerata in cui il numero di parametri è 0.

source: You can view `ACTION` as a degenerated parameterized action where the number of parameters is 0.
it_it: Si può vedere `ACTION` come un'azione parametrizzata degenerata in cui il numero di parametri è 0.

source: You can work around this by supplying a simpler mock interface than the mocked class provides.
it_it: Il problema si può aggirare fornendo una interfaccia più semplice del mock rispetto a quella fornita dalla classe mock-ata.

source: You can work around this by supplying a [simpler mock interface](#SimplerInterfaces) than the mocked class provides.
it_it: Il problema si può aggirare fornendo una [interfaccia più semplice del mock](#SimplerInterfaces) rispetto a quella fornita dalla classe mock-ata.

source: You can, but you need to make some changes.
it_it: Si può, ma si devono apportare alcune modifiche.

source: You can, of course, replace report.xml with whatever file name you prefer.
it_it: Ovviamente si può sostituire report.xml col nome file preferito.

source: You cannot do this with Return(std::make_unique<...>(...)).
it_it: Non lo si può fare con Return(std::make_unique<...>(...)).

source: You cannot do this with `Return(std::make_unique<...>(...))`.
it_it: Non lo si può fare con `Return(std::make_unique<...>(...))`.

source: You cannot generate any failure in OnTestPartResult() (otherwise it will cause OnTestPartResult() to be called recursively).
it_it: Non è possibile generare alcun errore in OnTestPartResult() (altrimenti si chiamerà ricorsivamente OnTestPartResult()).

source: You cannot generate any failure in `OnTestPartResult()` (otherwise it will cause `OnTestPartResult()` to be called recursively).
it_it: Non è possibile generare alcun errore in `OnTestPartResult()` (altrimenti si chiamerà ricorsivamente `OnTestPartResult()`).

source: You cannot mock a variadic function (i.e. a function taking ellipsis (...) arguments) directly in gMock.
it_it: Non è possibile mock -are una funzione variadica (ovvero una funzione che accetta argomenti con puntini di sospensione (...)) direttamente in gMock.

source: You cannot mock a variadic function (i.e. a function taking ellipsis (`...`) arguments) directly in gMock.
it_it: Non è possibile mock -are una funzione variadica (ovvero una funzione che accetta argomenti con puntini di sospensione `...`) direttamente in gMock.

source: You cannot stream a failure message to either macro.
it_it: Non è possibile accodare a uno stream un messaggio di errore a nessuna delle macro.

source: You could define your own matcher function or callback and use it with Truly(), as the previous couple of recipes have shown.
it_it: Si potrebbe definire la propria funzione matcher o callback e usarla con Truly(), come mostrato nelle due ricette precedenti.

source: You could define your own matcher function or callback and use it with `Truly()`, as the previous couple of recipes have shown.
it_it: Si potrebbe definire la propria funzione matcher o callback e usarla con `Truly()`, come mostrato nelle due ricette precedenti.

source: You could either put the expectations in sequence:
it_it: Si potrebbero mettere le expectation in sequenza:

source: You could just insert sleep() statements and hope for the best, but that makes your test behavior nondeterministic.
it_it: Si potrebbero semplicemente inserire le istruzioni sleep() e sperare per il meglio, ma ciò rende il comportamento del test non deterministico.
